OpenFOAM/simpleFsi-OF3.0.0/cases/case-1/0/pointDisplacementy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointScalarField;
    object      pointDisplacementy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    cylinder
    {
        type            calculated;
        value           uniform 0;
    }
    
    inlet
    {
        type            uniformFixedValue;
        uniformValue    constant 0;
    }
    
    outlet
    {
        type            uniformFixedValue;
        uniformValue    constant 0;
    }
    
    channel
    {
        type            uniformFixedValue;
        uniformValue    constant 0;
    }
    
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
